export default {
  categoryInfo: {
    title: 'Какую категорию <br/> выбрать? <br/> Как облагается налогом?',
    description:
      'Выберите категории, связанные с вашими услугами. <br/><br/>Мы берем 100% за самую дорогую категорию и 50% за каждую дополнительную.',
  },
  verificationPeriod: {
    title:
      'Какой срок верификации <br/> выбрать? <br/> Как облагается налогом?',
    description:
      'Вы можете выбрать длительность вашей верификации. Как только она закончится, вы можете её продлить. Чем дольше срок, тем ниже ежемесячная стоимость.',
  },
  business: {
    title: 'Что указать <br/> в описании бизнеса?',
    description:
      'Расскажите о себе и своем бизнесе.<br/><br/>К какой комьюнити вы относитесь? Где вы развиваетесь? Чем занимаетесь? Кто может поручиться за вас?<br/><br/>Чем больше информации — тем быстрее модерация.',
    buttonText: 'Понятно',
  },
  contact: {
    title: 'Какие контактные данные <br/> нам нужны от вас?',
    description:
      'Пожалуйста, укажите основные контактные данные для быстрой связи по вашей заявке.<br/><br/>Убедитесь, что вы добавили Telegram и хотя бы один альтернативный способ связи.',
    buttonText: 'Понятно',
  },
  links: {
    title: 'Какие ссылки <br/> нам нужны от вас?',
    description:
      'Добавьте ссылки на ваши каналы, форумы, страницы с отзывами и профили на других платформах.<br/><br/>К каждой ссылке добавьте краткое описание. Укажите все, что подтверждает вашу репутацию и статус.',
    buttonText: 'Понятно',
  },
  screenshot: {
    title: 'Какие контактные данные <br/> нам нужны от вас?',
    description:
      'Пожалуйста, укажите основные контактные данные для быстрой связи по вашей заявке.<br/><br/>Убедитесь, что вы добавили Telegram и хотя бы один альтернативный способ связи.',
    buttonText: 'Понятно',
  },
  attachedFiles: {
    title: 'Какие скриншоты <br/> нужно предоставить?',
    description:
      'Добавьте скриншоты, подтверждающие вашу деятельность.<br/><br/>Примеры: выполненные работы, отзывы, результаты верификации или другие доказательства вашей надежности.',
    buttonText: 'Понятно',
  },
  success: {
    title: 'Ваша заявка <br/> принята!',
    description:
      'Оплата успешно прошла. Ваша заявка находится на рассмотрении у модераторов.',
    buttonText: 'Отслеживать заявку',
    cancelText: 'Отмена',
  },
  successApplication: {
    title: 'Ваша заявка на продвижение успешно подтверждена!',
    successText: 'Отслеживайте по ID: #9149012-2024',
    buttonText: 'Посмотреть заявку',
    cancelText: 'Отмена',
    type: 'success',
    buttonType: 'secondary',
  },
  profileTrial: {
    title: 'Пробная верификация — что нужно знать',
    description:
      'Продавцы с пробной верификацией предоставили примеры работ, получили рекомендации и прошли первичную проверку без жалоб на мошенничество.<br/><br/>Они кажутся надежными, но всё ещё новички на платформе. Рекомендуем проявлять осторожность и всегда использовать Oracle Escrow для безопасности.',
    buttonText: 'Понятно',
    type: 'trial',
  },
  profileTrialArrow: {
    title: 'Пробная верификация — шаг вперёд',
    description:
      'Поздравляем! Вы прошли начальную проверку и получили статус пробной верификации. Это значит, что вы предоставили примеры работ, получили положительные отзывы и не имеете жалоб.<br/><br/>Так как вы новичок, покупателям нужно время, чтобы вам доверять. Для ускорения рекомендуем всегда использовать Oracle Escrow.<br/><br/>Показывайте высокое качество — и ваша репутация будет расти.',
    buttonText: 'Понятно',
    type: 'trial',
  },
  securityDeposit: {
    title: 'Что такое депозит безопасности Oracle?',
    description:
      'Депозит на странице продавца — это гарантия, которую он предоставляет.<br/><br/>Чем выше депозит, тем серьёзнее отношение продавца к бизнесу.<br/><br/>Для продавцов с пробной верификацией он помогает отсеять ненадежных участников. Тем не менее, даже высокий депозит — не гарантия. Используйте Oracle Escrow для дополнительной защиты.',
    buttonText: 'Понятно',
    type: 'deposit',
  },
  securityDepositMean: {
    title: 'Что значит депозит безопасности?',
    description:
      'Депозит на вашей странице продавца — это подтверждение вашей серьезности и профессионализма.<br/><br/>Чем он выше, тем больше доверия вызывает у покупателей. Для пробной верификации он особенно важен.<br/><br/>Однако доверие строится не только на депозите, а на стабильной работе.',
    buttonText: 'Понятно',
    type: 'deposit',
  },
  successNewCard: {
    title: 'Заявка на карту отправлена',
    description:
      'Мы уведомим вас, как только ваша карта будет выпущена и готова к использованию.',
    type: 'success',
    buttonText: 'Отмена',
  },
  blockCardPermission: {
    title: 'Вы уверены, что хотите заблокировать карту?',
    buttonText: 'Да',
    cancelText: 'Закрыть',
    buttonType: 'secondary',
    type: 'block',
  },
  cancellation: {
    title: 'Отмена предложения эскроу',
    description:
      'Вы уверены, что хотите отменить эту сделку эскроу?\n\nПокупатель не сможет её принять, и вы не получите оплату.',
    buttonText: 'Отменить предложение эскроу',
    cancelText: 'Закрыть',
  },
  accept: {
    title: 'Принятие предложения эскроу и пополнение',
    description:
      'Вы хотите принять это предложение эскроу и продолжить? После принятия оплата будет списана с вашего счета и помещена в эскроу. Сделка не может быть отменена после этого.',
    buttonText: 'Принять',
    cancelText: 'Закрыть',
  },
  dealAccept: {
    title: 'Принятие предложения эскроу',
    description:
      'Вы хотите принять это предложение эскроу и продолжить? После принятия оплата будет списана с аккаунта клиента и помещена в эскроу. Затем вы должны приступить к выполнению заказа.',
    buttonText: 'Принять',
    cancelText: 'Закрыть',
  },
  cancel_and_refund: {
    title: 'Отмена сделки эскроу и возврат',
    description:
      'Вы уверены, что хотите отменить эту сделку эскроу? После отмены клиенту будет возвращена вся сумма.',
    buttonText: 'Отменить и вернуть',
    cancelText: 'Закрыть',
  },
  escrow_offer_cancellation: {
    title: 'Отмена предложения эскроу',
    description:
      'Вы уверены, что хотите отменить это предложение эскроу? Продавец не будет его обрабатывать, а возврат будет произведён немедленно.',
    buttonText: 'Отменить предложение эскроу',
    cancelText: 'Закрыть',
  },
  confirm_payment: {
    title: 'Подтверждение сделки и выпуск оплаты',
    description:
      'Вы хотите подтвердить, что продавец выполнил все обязательства по сделке? После подтверждения средства из эскроу будут переведены продавцу. Это действие окончательно и необратимо.',
    buttonText: 'Подтвердить и перевести оплату',
    cancelText: 'Закрыть',
  },
  error: {
    title: 'Ошибка процесса',
    description:
      'Что-то пошло не так во время транзакции. Пожалуйста, попробуйте снова или вернитесь в эскроу.',
    buttonText: 'Отмена',
    cancelText: 'Закрыть',
  },
  offer_canceled: {
    title: 'Предложение эскроу отменено',
    description: 'Предложение эскроу #1010194 было отменено!',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  accept_and_pay: {
    title: 'Принятие предложения эскроу и пополнение',
    description:
      'Это действие необратимо! Пожалуйста, проверьте все детали сделки, суммы и сроки перед продолжением!',
    buttonText: 'Принять и пополнить',
    cancelText: 'Закрыть',
  },
  cancellation_refund: {
    title: 'Отмена сделки эскроу и возврат',
    description:
      'Это действие необратимо! После подтверждения средства будут возвращены клиенту, и вы не будете обязаны выполнять сделку. Клиент всё равно сможет оставить отзыв.',
    buttonText: 'Полный возврат клиенту',
    cancelText: 'Закрыть',
  },
  escrow_offer_canceled: {
    title: 'Предложение эскроу отменено',
    description:
      'Предложение эскроу #1010194 было отменено, и возврат зачислен на ваш счет.',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  deal_confirmation_payment_release: {
    title: 'Подтверждение сделки и выпуск оплаты',
    description:
      'Это действие необратимо! После подтверждения средства будут переведены продавцу, а все споры будут закрыты. Пожалуйста, проверьте всё внимательно — это действие нельзя отменить.',
    buttonText: 'Подтвердить и перевести продавцу',
    cancelText: 'Закрыть',
  },

  blackListSent: {
    type: 'success',
    title: 'Ваша жалоба успешно отправлена',
    description: '',
    buttonText: 'Хорошо!',
    cancelText: 'Закрыть',
  },

  escrow_offer_rejection: {
    title: 'Отклонение предложения эскроу',
    description:
      'Вы хотите отклонить это предложение эскроу? Вы не получите оплату и не будете обязаны выполнять сделку.',
    buttonText: 'Отклонить предложение эскроу',
    cancelText: 'Закрыть',
  },
  escrow_offer_accepted_payment_processed: {
    title: 'Предложение эскроу принято и оплата обработана',
    description:
      'Предложение эскроу #1010194 принято, средства списаны с клиента. Приступайте к выполнению заказа.',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  escrow_deal_canceled_refund_processed: {
    title: 'Сделка эскроу отменена и возврат обработан',
    description: 'Сделка эскроу #1010194 отменена, возврат произведён клиенту.',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  escrow_deal_completed_payment_released: {
    title: 'Сделка эскроу завершена и оплата переведена',
    description:
      'Сделка эскроу #1010194 завершена, средства переведены продавцу.',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  escrow_offer_accepted_payment_charged: {
    title: 'Предложение эскроу принято и оплата списана',
    description:
      'Предложение эскроу #1010194 принято, оплата списана с вашего счета. Свяжитесь с продавцом для дальнейших действий.',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  escrow_offer_rejected_by_you: {
    title: 'Предложение эскроу отклонено вами',
    description:
      'Предложение эскроу #1010194 было отклонено. Вы отклонили это предложение. Клиент не будет списан, и вы не обязаны выполнять заказ.',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  escrow_offer_rejected_by_you_order: {
    title: 'Предложение эскроу отклонено вами',
    description:
      'Предложение эскроу #1010194 было отклонено. Вы не были списаны, и продавец не будет выполнять заказ.',
    buttonText: 'В эскроу',
    cancelText: 'Закрыть',
  },
  escrow_payment_failed: {
    title: 'Ошибка оплаты эскроу!',
    description:
      'Не удалось завершить оплату. Пожалуйста, проверьте ваш баланс.',
    buttonText: 'Пополнить баланс Oracle',
    cancelText: 'Закрыть',
  },
}
