export default {
  pageTitle: 'Результат верификации',
  detailsFor: 'Детали верификации для',
  section1: 'Раздел 1',
  text1:
    'Он пережил не только пять веков, но и переход к электронному набору, оставаясь по сути неизменным.',
  text2:
    'Давно установлено, что читатель будет отвлекаться на читаемый текст страницы при просмотре её макета. Суть использования Lorem Ipsum в том, что он имеет более или менее нормальное распределение букв, в отличие от использования "Контент здесь, контент здесь", что делает его похожим на читаемый английский. Многие программы для настольных издательств и редакторы веб-страниц теперь используют Lorem Ipsum в качестве стандартного текстового шаблона, и поиск по "lorem ipsum" обнаружит множество веб-сайтов, находящихся ещё в зачаточном состоянии. За прошедшие годы появились различные версии, иногда случайно, иногда намеренно (с добавлением юмора и тому подобного).',
  text3:
    'Он пережил не только пять веков, но и переход к электронному набору, оставаясь по сути неизменным.',
  text4:
    'Лёрэм ипсум декагонес патесаде, пыс тинде. Фест вирад юде погт хурувюда беперлига крохетен орад. Посере мирев ифалл карибель бан. Мултирилоги покаре, оакот прейскап эр нылюнг и бана ласамма абельт.',
}
