export interface ChartData {
  labels: string[]
  data: number[]
}

export const chartDataByPeriod: Record<string, ChartData> = {
  '1D': {
    labels: ['00:00', '06:00', '12:00', '18:00', '24:00'],
    data: [2100, 2300, 2500, 2400, 2600]
  },
  '7D': {
    labels: ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс'],
    data: [2100, 2500, 2400, 2300, 2200, 2332, 2600]
  },
  '30D': {
    labels: ['1', '5', '10', '15', '20', '25', '30'],
    data: [2000, 2200, 2400, 2300, 2500, 2700, 2600]
  },
  '180D': {
    labels: ['Янв', 'Фев', 'Мар', 'Апр', 'Май', 'Июн'],
    data: [1800, 2000, 2200, 2400, 2600, 2800]
  },
  '360D': {
    labels: ['Янв', 'Апр', 'Июл', 'Окт'],
    data: [1500, 2000, 2500, 3000]
  }
} 